
# list = [1,2,3,4,5,6,7,8]
# low = 0
# high = len(list)-1
# while(low<high):
#     if list[low]>list[high]:
#         low = low+1
#     else:
#         high = high - 1    
#?===============================================================================================

#* chatgpt 

# list = [1,2,3,4,5,6,7,8]
# low = 0
# high = len(list) - 1

# while (low < high):
#     print(f"Comparing list[{low}] = {list[low]} and list[{high}] = {list[high]}")
    
#     if list[low] > list[high]:
#         low = low + 1
#     else:
#         high = high - 1


#?===============================================================================================
# lst1 = [4,5,6,7]
# lst2 = [3,8,9,11]
#*  output : lst = [3,4,5,6,7,8,9,11]


#?===============================================================================================
# n = 10
# i = n
# while(i>=n):
#     print(i)
#     i = i//2    #todo - Time Complexity: O(1)  ← constant time

#?===============================================================================================
#find time complexity for this program 

# i = 0
# j = 0
# n = 10
# while(i<=n):
#     while(j<=n):
#         print(i,j)
#         j = j+1     
#     i = i+1

#?===============================================================================================




